# sem3-pract
Напишите программу на языке _Python_, в которой будет реализовано решение задачи (соответствующего вашему номеру в списке студентов варианта).

Код требуется оформить в виде функции и предусмотреть ввод некорректных значений.

Код требуется протестировать, см. страницу в курсе _«Правила публикации заданий»_.

#### Замечания по реализации:
* для ввода значений с клавиатуры используйте метод `input()`;
* для использования некоторых функций удобно использовать библиотеку `math`. Для использования необходимо: (1) подключить её с помощью команды `import`, (2) обращаться к свойствам и методам.  
Например, выведем константу _e_ на экран:  
```python
import math
print(math.e)
>> 2.718281828459045
```

#### Требования к функции и программе:
- оформление должно соответствовать стандарту [PEP8](https://www.python.org/dev/peps/pep-0008/);
- должна возвращать и печатать значение (переменная `result`) для переданного ей аргумента;
- должна возвращать `None`, если на вход ей было передано некорректное значение; 
- тесты должны содержатся в блоке кода после `if __name__ == '__main__':`;
- функция должна содержать описание, выполненное с помощью docstring.

### Оформление тестов

Тесты должны быть оформлены следующим образом: 
- один тест — одна функция;
- название функции начинается со слова тест, слова отделяются символом «_»;
- в качестве оператора проверки используется оператор `assert`.

Пример ниже:
```python

def test_first_perfect_number():
    assert is_perfect_number(6) == True "наименьшее совершенное число должно быть 6"

def test_bad_input_value():
   assert is_perfect_number('6') == None "при входном аргументе неверного типа должно быть None"
    
```
